#+TITLE: チルノのパーフェクトフォワーディング (完全転送) 教室
#+AUTHOR: MasWag

** Motivation of rvalue reference

#+BEGIN_SRC C++ :noweb yes :results output replace
  <<PREVENT_COPY>>

  int main(int argc, char *argv[])
  {
    copy_and_move();
    return 0;
  }

#+END_SRC

#+RESULTS:
: default constructor
: 7f8aa9405a80
: copy constructor
: 7f8aa9405a80
: 7f8aa9405a90
: move constructor
: 0
: 7f8aa9405a90
: 7f8aa9405a80

** std::move
  :PROPERTIES:
  :header-args: :C :flags "-std=c++17"
  :END:

#+BEGIN_SRC C++ :noweb yes :results output replace :includes "<iostream> <algorithm>"
  <<PREVENT_COPY>>
  <<MOVE>>

  int main(int argc, char *argv[])
  {
    copy_and_move2();
    return 0;
  }

#+END_SRC

#+RESULTS:
: default constructor
: 7fbffcc05a80
: copy constructor
: 7fbffcc05a80
: 7fbffcc05a90
: move constructor
: 0
: 7fbffcc05a90
: 7fbffcc05a80

** Universal references
  :PROPERTIES:
  :header-args: :C :flags "-std=c++17"
  :END:

#+BEGIN_SRC C++ :noweb yes :results output replace :includes "<iostream> <algorithm>"
  <<UNIVERSAL_REFERENCE>>

  int main(int argc, char *argv[])
  {
    universal();
    return 0;
  }

#+END_SRC

#+RESULTS:
: lvalue ref
: rvalue ref
: lvalue ref


** Perfect forwarding
  :PROPERTIES:
  :header-args: :flags "-std=c++17"
  :END:

#+BEGIN_SRC C++ :noweb yes :results output replace :includes "<iostream> <algorithm>"
<<UNIVERSAL_REFERENCE>>
<<PERFECT_FORWARDING>>

  int main(int argc, char *argv[])
  {
    perfect_forward();
    return 0;
  }
#+END_SRC

#+RESULTS:
: lvalue ref
: lvalue ref
: rvalue ref
: rvalue ref
: lvalue ref
: rvalue ref

